### Парсер языка + AST

Задача является основой всей последующей работы

#### Постановка задачи

Эта задача подразумевает создание парсера языка и построения абстрактного синтаксического дерева по тексту программы

#### Описание алгортима

При разработке использовались следующие срества:
*GPLex* - лексический анализатор
*GPPG* - синтаксический анализатор

#### Входные данные

Текст программы

#### Выходные данные

Абстрактное синтаксическое дерево

#### Пример применения

//в переменной text находится текст программы

`Scanner scanner = new Scanner();`

`scanner.SetSource(text, 0);`


`Parser parser = new Parser(scanner);`

`var b = parser.Parse();`

`if (!b)`

`	Console.WriteLine("Ошибка");`

`else Console.WriteLine("Программа распознана");`

`var prettyVisitor = new PrettyPrintVisitor();`

`parser.root.Accept(prettyVisitor);`

`Console.WriteLine(prettyVisitor.Text);`



 **Пример правильной программы** 


`{`

`	b = -2;`

`	a = 3;`

`	a = -b;`

`	c = b + 2;`

`	d = a * b + c * d + 3;`

`	if 1`

`	b = 1;`

`	else`

`	{`

`		b = 0;`

`	}`

`	if a`

`	a = 1;`

`	while x <= 10 do`

`	{`

`		x = x + 1;`

`	}`

`	cycle 3`

`	{`

`		a = a + a;`

`	}`

`	for i=1 to 10 do`

`		a = a + i;`

`}`

