### Удаление мертвого кода

Задача является основой для удаления мертвого кода

#### Постановка задачи

Эта задача подразумевает удаление мертвого кода в рамках одного базового блока

#### Описание алгортима

Проходимся по элементам трехадресного кода в рамках блока (в обратном направлении)
переменная может быть активной и неактивной, изначально все переменные считаются актиными (они могут использоваться в других блоках)
удаляем элементы трехадресного кода, которые явдяются присвоением и переменная, которой присваивается значение, является неактивной
если переменной присваивается значение, она помечается как неактивная
если переменная используется в правой части, она помечается как активная

Повторяем вышеизложенные действия пока количество элементов в трехадресном коде не перестанет меняться

#### Входные данные

Базовый блок

#### Выходные данные

Базовый блок без мертвого кода

#### Пример применения

```cs
foreach (var block in blocks)
{

    Console.WriteLine(block.ToString());

    DeadCodeDeleting.optimizeDeadCode(block);

    Console.WriteLine("After optimization:");

    Console.WriteLine(block.ToString());

    Console.WriteLine("-------");

}
```


#### Пример1

```cs
{

  b = 2;

  a = 3;

  a = b;

  c = b + 2;

  d = a * b;

}```

##### Результат:

Block B0
Ins: []
          b := 2
          a := 3
          a := b
          c := b + 2
          d := a * b
JumpOut: 
Out: 

After optimization:
Block B0
Ins: []
          b := 2
          a := b
          c := b + 2
          d := a * b
JumpOut: 
Out: 

#### Пример2

```cs
{

  b = 2;

  a = 3;

  a = 5;

  c = b + 2;

  b = 4;

  d = a * b;

  c = 3;

}
```

##### Результат:

```
Block B0
Ins: []
          b := 2
          a := 3
          a := 5
          c := b + 2
          b := 4
          d := a * b
          c := 3
JumpOut: 
Out: 

After optimization:
Block B0
Ins: []
          a := 5
          b := 4
          d := a * b
          c := 3
JumpOut: 
Out: 
```


