### Оптимизация общих подвыражений

#### Постановка задачи

Задача подразумевает оптимизацию одинаковых выражений в рамках одного базового блока.

#### Описание алгортима

Алгоритм реализован в 2 прохода. При первом проходе мы ищем одинаковые подвыражения среди элементов трёхадресного кода базового блока и запоминаем их местоположение в базовом блоке. Далее, при втором проходе происходит создание вспомогательной переменной и замена общего подвыражения.
Для хранения подвыражений создана структура `BinaryExpression`, которая также отвечает за сравнение подвыражений.

#### Входные данные

Базовый блок

#### Выходные данные

Базовый блок с замененными общими подвыражениями

#### Пример применения

```cs
{
	var block = new BaseBlock();
    ...
    var cse = new CommonExperssions();
    Console.WriteLine(block);
    cse.Optimize(block);
    Console.WriteLine("After optimization:");
    Console.WriteLine(block);
}
```


#### Пример

```
{
  ...
  b = 2 + a;
  a = 3;
  c = 2 + a;
  d = a + 2;
}
```

##### Результат:
```
  b = 2 + a;
  a = 3;
  tmp0 = 2 + a;
  c = tmp0;
  d = tmp0;
```