### Классификация ребёр: наступающие, отступающие, поперечные

Данная задача нужны для определения типов ребер в графе потока управления (далее CFG).

#### Постановка задачи

Данн CFG. Необходимо классифицировать каждое его ребро.
Для решения данной задачи необходимо [глубинное островное дерево](#глубинное-островное-дерево)

#### Типы ребер

Был создан enum тип для представления типов ребер

```cs
public enum EdgeType
{
    Unknown = 0,
    Coming = 1,
    Retreating = 2,
    Cross = 3,
    Backward = 4
}
```

Так же был создан класс, который представляет собой Dictionary, где Key имеет тип Edge, а Value - EdgeType

```cs
public class EdgeTypes: Dictionary<Edge<BaseBlock>, EdgeType>
{
    public override string ToString()
    {
        return string.Join("\n", this.Select(ed => $"[{ed.Key.Source.Name} -> {ed.Key.Target.Name}]: {ed.Value}"));
    }
}
```

В класс ControlFlowGraph было добавленно свойство EdgeTypes, которое по каждому ребру в CFG возвращает его тип

```cs
public class ControlFlowGraph
{
    ...
    public EdgeTypes EdgeTypes { get; set; }
	...
}
```

#### Описание алгоритма

1. Строим глубинное островное дерево для CFG
2. Проходим по всем ребрам в CFG и классифицирем их согласно определению

#### Входные данные
Список базовых блоков

#### Выходные данные
CFG с классифицированными ребрами

#### Пример применения

```cs
var blocks = BaseBlockDivider.divide(linearCode.code);
Console.WriteLine("Edge Types:");
Console.WriteLine(blocks.EdgeTypes);
```
